app/controllers/resumes_controller.rb

  def works
    @resumes = Resume.all
---
SELECT "resumes".* FROM "resumes"

  def create
    @resume = Resume.new(resume_params)
    if @resume.save
---
INSERT INTO "resumes" ("title", "content", "Github", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "おいおい"], ["content", "だいじょぶんか"], ["Github", "git"], ["created_at", "2019-02-11 19:38:44.320535"], ["updated_at", "2019-02-11 19:38:44.320535"]]

  def destroy
    @resume = Resume.find(params[:id])
    @resume.destroy
---
SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "resumes" WHERE "resumes"."id" = ?  [["id", 11]]